tests/cassettes/test_fulfillments/test_submit_offer_state_action.yaml

interactions:
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Header
      xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:Action>http://www.cdiscount.com/IMarketplaceAPIService/SubmitOfferStateAction</wsa:Action><wsa:MessageID>urn:uuid:1711d97f-5a9e-4cdc-a190-9d30fbf10a70</wsa:MessageID><wsa:To>https://wsvc.cdiscount.com/MarketplaceAPIService.svc</wsa:To></soap-env:Header><soap-env:Body><ns0:SubmitOfferStateAction
      xmlns:ns0="http://www.cdiscount.com"><ns0:headerMessage><ns1:Context xmlns:ns1="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns1:CatalogID>1</ns1:CatalogID><ns1:SiteID>100</ns1:SiteID></ns1:Context><ns2:Localization
      xmlns:ns2="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns2:Country>Fr</ns2:Country></ns2:Localization><ns3:Security
      xmlns:ns3="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages"><ns3:DomainRightsList
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:IssuerID
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:SessionID
      xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/><ns3:TokenId>6f4f7d53de424aa6bd641b1b8f4fe85a</ns3:TokenId><ns3:UserName></ns3:UserName></ns3:Security><ns4:Version
      xmlns:ns4="http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages">1.0</ns4:Version></ns0:headerMessage><ns0:offerStateRequest><ns0:Action>Unpublish</ns0:Action><ns0:SellerProductId>11504</ns0:SellerProductId></ns0:offerStateRequest></ns0:SubmitOfferStateAction></soap-env:Body></soap-env:Envelope>'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '1715'
      Content-Type:
      - text/xml; charset=utf-8
      SOAPAction:
      - '"http://www.cdiscount.com/IMarketplaceAPIService/SubmitOfferStateAction"'
      User-Agent:
      - Zeep/3.3.1 (www.python-zeep.org)
    method: POST
    uri: https://wsvc.cdiscount.com/MarketplaceAPIService.svc
  response:
    body:
      string: "<s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\"><s:Body><SubmitOfferStateActionResponse\
        \ xmlns=\"http://www.cdiscount.com\"><SubmitOfferStateActionResult xmlns:i=\"\
        http://www.w3.org/2001/XMLSchema-instance\"><ErrorMessage xmlns=\"http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages\"\
        >Vendeur de type CDiscount non autoris\xE9 !</ErrorMessage><OperationSuccess\
        \ xmlns=\"http://schemas.datacontract.org/2004/07/Cdiscount.Framework.Core.Communication.Messages\"\
        >false</OperationSuccess><ErrorList><Error><ErrorType>SellerNotFound</ErrorType><Message>Vendeur\
        \ de type CDiscount non autoris\xE9 !</Message></Error></ErrorList><SellerLogin>SELLER_LOGIN</SellerLogin><TokenId>TOKEN_ID</TokenId></SubmitOfferStateActionResult></SubmitOfferStateActionResponse></s:Body></s:Envelope>"
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Date:
      - Mon, 15 Apr 2019 14:05:43 GMT
      Vary:
      - Accept-Encoding
      content-length:
      - '831'
    status:
      code: 200
      message: OK
version: 1
